{
    "login": {
        "title": "Connexion",
        "username": "Nom d'utilisateur",
        "password": "Mot de passe",
        "login": "Connexion",
        "invalid_credentials": "Nom d'utilisateur ou mot de passe invalide.",
        "empty_username": "Veuillez entrer votre nom d'utilisateur.",
        "empty_password": "Veuillez entrer votre mot de passe.",
        "first_time_login": "Première fois ? Créez un compte !"
    },
    "register": {
        "title": "Créer un compte",
        "previous": "Précédent",
        "next": "Suivant",
        "already_have_account": "Déjà un compte ? Connectez-vous !",
        "username": "Nom d'utilisateur",
        "empty_username": "Veuillez entrer un nom d'utilisateur.",
        "invalid_username": "Le nom d'utilisateur doit contenir au moins 4 caractères",
        "email": "Adresse e-mail",
        "empty_email": "Veuillez entrer une adresse e-mail.",
        "invalid_email": "Veuillez entrer une adresse e-mail valide.",
        "password": "Mot de passe",
        "empty_password": "Veuillez entrer un mot de passe.",
        "invalid_password": "Le mot de passe doit contenir au moins 8 caractères, une majuscule, une minuscule et un chiffre.",
        "confirm_password": "Confirmer le mot de passe",
        "empty_confirm_password": "Veuillez confirmer votre mot de passe.",
        "passwords_do_not_match": "Les mots de passe ne correspondent pas.",
        "birthdate": "Date de naissance",
        "empty_birthdate": "Veuillez entrer votre date de naissance.",
        "invalid_birthdate": "Vous devez avoir au moins 18 ans pour vous inscrire.",
        "height": "Taille (cm)",
        "empty_height": "Veuillez entrer votre taille.",
        "invalid_height": "Veuillez entrer une taille valide.",
        "weight": "Poids (kg)",
        "empty_weight": "Veuillez entrer votre poids.",
        "invalid_weight": "Veuillez entrer un poids valide.",
        "gdpr_consent_title": "Consentement RGPD",
        "gdpr_consent": "J'accepte le formulaire de consentement RGPD et la Politique de Confidentialité (Obligatoire).",
        "gdpr_consent_invalid": "Vous devez accepter le formulaire de consentement RGPD et la Politique de Confidentialité.",
        "marketing_consent": "J'accepte de recevoir des communications marketing (Facultatif).",
        "avatar_choose": "Choisir ton avatar",
        "create_account": "Créer un compte"
    },
    "home": {
        "error_loading": "Erreur lors du chargement des données."
    },
    "camera": {
        "next_step_countdown": "Prochaine étape dans $seconds secondes...",
        "start_workout": "Démarrer"
    },
    "notifications": {
        "title": "Notifications",
        "read_all": "Tout lire",
        "empty": "Aucune notification pour le moment.",
        "no_title": "Aucun titre",
        "no_body": "Aucun contenu"
    },
    "profile": {
        "follow": "Suivre",
        "unfollow": "Ne plus suivre",
        "member_since": "Membre depuis $date",
        "followers": "abonnés",
        "following": "abonnements",
        "cities_finished": "Villes finies",
        "nb_exercises_done_title": "Nombre d'exercices faits",
        "bpm_title": "BPM (Battements par minute)",
        "achievements": "Succès"
    },
    "social": {
        "title": "Social"
    },
    "gdpr_consent_form": {
        "title": "Consentement RGPD",
        "description": "Conformément au Règlement Général sur la Protection des Données (RGPD), nous sommes tenus de vous informer sur la collecte, l'utilisation et le stockage de vos données personnelles.",
        "data_collection": {
            "title": "1. Données Collectées\n",
            "description": "Nous collectons les données suivantes lors de l'inscription :\n",
            "essential_data": " - Données essentielles : nom d'utilisateur, adresse e-mail, mot de passe, date de naissance pour accéder à l'application.\n",
            "optional_data": " - Données facultatives : taille, poids, objectifs, niveau de forme physique, particularités physiques pour personnaliser votre expérience utilisateur.\n"
        },
        "data_usage": {
            "title": "2. Utilisation des Données\n",
            "description": "Nous utilisons vos données pour les finalités suivantes :\n",
            "purposes_1": " - Vous permettre d'accéder à l'application et de profiter de ses fonctionnalités.\n",
            "purposes_2": " - Personnaliser votre expérience utilisateur en fonction de vos objectifs et de votre niveau de forme physique.\n",
            "purposes_3": " - Pour respecter nos obligations légales et réglementaires.\n"
        },
        "data_storage": {
            "title": "3. Stockage des Données\n",
            "description": "Vos données sont stockées de manière sécurisée sur nos serveurs et ne sont pas partagées avec des tiers sans votre consentement.\n"
        },
        "marketing_usage": {
            "title": "4. Utilisation Marketing\n",
            "description": "Nous utilisons vos données pour vous envoyer des e-mails marketing concernant des promotions, événements ou rappels liés à l'application.\n"
        },
        "accept_button": "Continuer"
    },
    "workout_session_dialog": {
        "session_title": "Session n°$session_number",
        "start_button": "Démarrer"
    },
    "settings": {
        "title": "Paramètres",
        "language": "Langue",
        "notifications": "Notifications",
        "disable_notifications_info": "Les notifications ont été désactivées. Vous pouvez les réactiver plus tard dans les paramètres de votre appareil si nécessaire.",
        "account": "Compte",
        "username":"Nom d'utilisateur",
        "edit_username_title": "Modifier le nom d'utilisateur",
        "edit_username_confirmation": "Voulez-vous vraiment modifier votre pseudo ?",
        "email": "E-mail",
        "edit_email_title": "Modifier l'e-mail",
        "edit_email_confirmation": "Voulez-vous vraiment modifier votre adresse e-mail ?",
        "change_password": "Changer le mot de passe",
        "delete_account": "Supprimer le compte",
        "delete_account_fail": "Échec de la suppression du compte",
        "delete_account_error": "Erreur lors de la suppression",
        "others": "Autres",
        "delete_account_confirmation": "Êtes-vous sûr de vouloir supprimer votre compte ? Cette action est irréversible.",
        "logout": "Se déconnecter",
        "languages": {
            "fr": "Français",
            "en": "Anglais"
        },
        "cancel": "Annuler",
        "confirm": "Confirmer",
        "delete_confirm_title": "Confirmer la suppression",
        "privacy_policy": "Avis sur la confidentialité",
        "privacy_policy_description": "Nous nous engageons à protéger votre vie privée. Toutes vos données sont confidentielles et ne seront jamais partagées sans votre consentement.",
        "save": "Sauvegarder",
        "overlay_title": "Position du compteur",
        "left": "Gauche",
        "bottom": "Bas"
    },
    "customization": {
        "title": "Quel look pour ce voyage ?",
        "next_button": "Suivant",
        "confirm_button": "Terminer"
    },
    "introduction": {
        "text_1": "Tout a commencé par une simple envie : se remettre au sport.",
        "text_2": "Pour cela, le joueur choisit une petite randonnée en forêt, sans se douter qu'elle marquerait le début d'un long périple.",
        "text_3": "Originaire de Rome, il marche, marche… jusqu'à se perdre complètement.",
        "text_4": "Alors qu'il fait une pause pour reprendre son souffle, un hamster surgit devant lui.",
        "text_5": "Pas un hamster ordinaire : celui-ci parle ! Intrigués, ils engagent la conversation.",
        "text_6": "Attends une minute… Tu viens de Rome, c'est ça ? Eh bien mon pote… t'es plus près de Paris que de ton lit !",
        "text_7": "Oh, tu fais cette tête-là. Je sais, ça surprend. Mais bon, faut dire que t'as sacrément marché ! T'as un bon pas, je te le reconnais.",
        "text_8": "Écoute, t'as de la chance de m'être tombé dessus. Je suis un grand explorateur, moi ! L'Europe ? Je la connais comme mes poches. Bon, j'ai pas de poches, mais tu vois l'idée.",
        "text_9": "Si tu veux, je peux te ramener à Rome. Et tant qu'à faire, on en profitera pour te cultiver un peu. T'aimes les anecdotes historiques, non ?"
    },
    "anecdotes": {
        "sacre_coeur": "Ah, le Panthéon de Paris ! Rien à voir avec les dieux romains, celui-là, c'est pour les grands humains. Voltaire, Rousseau, Marie Curie… ils sont tous là, peinards dans la crypte. Une vraie coloc de génies.",
        "notre_dame": "Ah, Notre-Dame de Paris ! Commencée en 1163, finie 200 ans plus tard. Ici, y'a eu le sacre de Napoléon, la Révolution qui l'a bien abîmée, et un Victor Hugo qui l'a rendue célèbre avec son Quasimodo. Même l'incendie de 2019 l'a pas fait plier. Une vraie survivante, cette cathédrale !",
        "louvre": "Le Louvre ! À la base, une forteresse du XIIe siècle pour protéger Paris. Puis les rois l'ont transformé en palais, surtout François Ier et Louis XIV — jusqu'à ce que ce dernier préfère Versailles. Depuis la Révolution, c'est un musée, et pas n'importe lequel : le plus grand du monde !",
        "obelisk": "L'Obélisque de la Concorde ! Un vrai morceau d'Égypte planté en plein Paris. Offert par le vice-roi d'Égypte en 1830, il date de plus de 3 000 ans et vient du temple de Louxor. Y'a même des hiéroglyphes dessus qui racontent les exploits de Ramsès II.",
        "opera_paris": "L'Opéra Garnier, rien que ça ! Construit sous Napoléon III, inauguré en 1875… Un vrai bijou du style Second Empire. Escaliers en marbre, plafonds peints, dorures partout — t'as l'impression d'entrer dans un gâteau de luxe.",
        "triumph_arc": "L'Arc de Triomphe ! Commandé par Napoléon en 1806 pour célébrer ses victoires… mais il a pas eu le temps de le voir fini. Il trône au milieu de la plus grosse étoile de routes de Paris, comme un boss final de la circulation.",
        "eiffel_tower": "La Tour Eiffel ! Construite pour l'Expo universelle de 1889, et à la base… elle devait être démontée après 20 ans ! Résultat : c'est devenu le symbole de Paris. À l'époque, certains trouvaient ça moche — maintenant, tout le monde veut sa photo avec.",

        "la_serre_du_parc_de_la_tete_or": "Le Parc de la Tête d'Or, c'est un vrai coin de nature en pleine ville ! Ouvert en 1857, c'est l'un des plus grands parcs urbains de France. Et cette serre ? Une vraie jungle tropicale en plein Lyon ! Construite en 1890, elle abrite des plantes rares et exotiques. Parfait pour se croire ailleurs sans quitter la ville.",
        "opera_lyon": "L'Opéra de Lyon, c'est un mix de classique et de moderne ! Le bâtiment principal date de 1831, mais la grande salle a été rénovée dans les années 90 avec une architecture super contemporaine.",
        "cathedrale_st_jean": "La Cathédrale Saint-Jean, c'est la star du Vieux Lyon ! Construite entre le XIIe et le XVe siècle, elle mélange plein de styles : roman, gothique. Et regarde cette horloge astronomique du XIVe siècle, une vraie merveille ! Elle indique pas juste l'heure, mais aussi les phases de la lune, les fêtes religieuses… un gadget médiéval ultra sophistiqué.",
        "statue_équestre_de_louis_XIV": "La Place Bellecour, c'est le cœur de Lyon, la deuxième plus grande place piétonne d'Europe ! Elle est là depuis le XVIIe siècle, un vrai lieu de rendez-vous pour les Lyonnais.",
        "fontaine_bartholdi": "La Fontaine Bartholdi, c'est une sacrée œuvre d'art en plein cœur de Lyon ! Créée par Frédéric Bartholdi — oui, le gars qui a imaginé la Statue de la Liberté. Elle représente la ville de Lyon, portée par quatre chevaux puissants. Chaque cheval symbolise un grand fleuve de la région.",
        "theatre_antique": "Le Théâtre Antique de Lyon, c'est du lourd ! Construit au Ier siècle, c'est l'un des plus vieux théâtres romains encore debout. Il pouvait accueillir jusqu'à 10 000 spectateurs — autant dire que les pièces, ça se jouait en grand !",
        "basilique_notre-dame_de_fourviere": "La Basilique de Fourvière, c'est le symbole de Lyon perché sur sa colline. Construite entre 1872 et 1884, elle a été édifiée après la guerre franco-prussienne. Son architecture mêle roman et byzantin, avec des mosaïques magnifiques et des vitraux colorés.",


        "galerie_victor_emmanuel_2": "La Galerie Victor Emmanuel II ? C'est le grand salon de Milan ! Inaugurée en 1877, elle porte le nom du premier roi d'Italie unifiée. Une vraie fierté nationale.",
        "chateau_des_sforza": "Le Château des Sforza, c'est du costaud ! Construit au XVe siècle par la puissante famille Sforza, c'était à la fois une forteresse, un palais… et un symbole de pouvoir à Milan. Léonard de Vinci y a même bossé! Et aujourd'hui, c'est rempli de musées, avec des œuvres de Michel-Ange, entre autres. Franchement, c'est un peu un château à trésors.",
        "plazza_del_duomo": "La Piazza del Duomo, c'est le cœur battant de Milan ! Depuis des siècles, tout part de là. Le Duomo ? Commencé en 1386, il a fallu près de 500 ans pour le terminer. 135 flèches, des milliers de statues, et la Madonnina dorée tout en haut qui veille sur la ville. C'est pas juste une place, c'est une leçon d'histoire à ciel ouvert !",
        "santa_maria_delle_grazie": "Santa Maria delle Grazie, c'est pas juste une église gothique classe, c'est carrément un trésor classé à l'UNESCO ! Construite entre 1463 et 1497, elle a été confiée à l'ordre dominicain, et c'est Ludovic Sforza, le duc de Milan, qui a commandé la rénovation de son cloître . Et surtout… dans le réfectoire, y'a La Cène de Léonard de Vinci. Peinte direct sur le mur entre 1495 et 1498.",
        "arco_della_pace": "L'Arco della Pace, c'est la grande porte de Milan vers la paix. Construite au début du XIXe siècle, elle célèbre la fin des guerres napoléoniennes et la paix retrouvée en Europe.",

        "basilique_saint_pierre": "La Basilique Saint-Pierre, c'est LE cœur du Vatican et l'une des plus grandes églises du monde. Construite sur la tombe de Saint Pierre, l'un des apôtres de Jésus, elle a été édifiée entre le XVIe et le XVIIe siècle.",
        "pantheon_rome": "Le Panthéon de Rome, c'est un chef-d'œuvre antique qui a traversé les siècles. Construit il y a près de 2 000 ans sous l'empereur Hadrien, c'était un temple dédié à tous les dieux de Rome. Sa coupole énorme, avec ce fameux oculus au centre, c'est un tour de force architectural — la plus grande coupole en béton non armé du monde !",
        "chateau_saint_ange": "Le Château Saint-Ange, c'est une forteresse qui en a vu du monde ! À l'origine, c'était un mausolée construit pour l'empereur Hadrien il y a près de 2 000 ans. Puis, au fil des siècles, il est devenu une forteresse, une résidence papale, et même une prison.",
        "collisee": "Le Colisée, c'est LE stade antique par excellence ! Construit entre 70 et 80 après J.-C., il pouvait accueillir jusqu'à 50 000 spectateurs prêts à vibrer pour les combats de gladiateurs et autres spectacles. Ce truc était une vraie machine à sensations : courses de chars, chasses d'animaux, mises en scène épiques...",
        "fontaine_de_trevi": "La Fontaine de Trevi, c'est la star des fontaines à Rome ! Construite au XVIIIe siècle, elle marque la fin de l'aqueduc qui apportait l'eau à la ville depuis l'Antiquité. La tradition dit que si tu jettes une pièce par-dessus ton épaule dans la fontaine, tu reviendras forcément à Rome."
    }
}